---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalResourceLoadContext
source: html/e4ac8ccd-8e69-ce38-99cd-18398e7f4a6a.htm
---
# ExternalResourceLoadContext Methods

Indicates whether the document requesting the external resource has a defined
 ModelPath.